{
  "career": [
    {
      "role": "Senior Technology Programmer",
      "company": "Techland",
      "logo": "/images/logos/techland.png",
      "time": "Sep 2017 - Present",
      "description": "Together with the team at Techland, we're implementing online features for AAA games. My work revolves around integrating their custom engine with partners' SDKs (Steam, Epic Online Services, PlayStation Network, Xbox Live, etc.) and leading the design and development of the team's core C++ libraries.",
      "skills": ["C++", "Engine Development", "Game Development", "Network Programming"]
    },
    {
      "role": "Co-founder, Fullstack Developer",
      "company": "Finibit",
      "logo": "/images/logos/finibit.png",
      "time": "Oct 2018 - Present",
      "description": "Finibit is a company I set up with my friend as a side business years ago. We're building custom web apps in Node.js and React. Depending on the circumstances, I enjoy being a CEO, CTO, CFO, or software developer.",
      "skills": ["JavaScript", "Node.js", "Rect.js", "Web Development"]
    },
    {
      "role": "Information Technology Lecturer",
      "company": "WSB Merito",
      "logo": "/images/logos/merito.png",
      "time": "Oct 2019 - Jul 2021 · 1 yr 10 mos",
      "description": "I authored and conducted classes on building web apps for Microsoft Azure. The curriculum was designed to teach students the basics of VMs, storage options, databases, and deployment strategies for static websites and web apps.",
      "skills": ["JavaScript", "Microsoft Azure", "Teaching"]
    },
    {
      "role": "Senior Software Engineer",
      "company": "Gigaset",
      "logo": "/images/logos/gigaset.png",
      "time": "Jul 2016 - Aug 2017 · 1 yr 2 mos",
      "description": "I started as a C++ programmer writing core services for DECT devices. I later moved to develop the web admin interface for those devices.",
      "skills": ["C++", "JavaScript", "Embedded Development", "Web Development", "Linux", "Angular", "Bootstrap"]
    },
    {
      "role": "C++ Software Engineer",
      "company": "Nokia Networks",
      "logo": "/images/logos/nokia.png",
      "time": "Mar 2013 - Jun 2016 · 3 yrs 4 mos",
      "description": "I was writing software for base stations according to the specification and prototyping cloud solutions for the next generation of hardware.",
      "skills": ["C++", "Embedded Development", "Linux"]
    },
    {
      "role": "Games Programmer",
      "company": "Plata Games",
      "logo": "/images/logos/platagames.png",
      "time": "Jun 2012 - Mar 2013 · 10 mos",
      "description": "I was porting PC games to Nintendo DS and 3DS consoles and leading the development of a proprietary 2D game engine for Nintendo 3DS.",
      "skills": ["C++", "Engine development", "Game Development"]
    },
    {
      "role": "Games Developer",
      "company": "PlayWay",
      "logo": "/images/logos/playway.png",
      "time": "Jan 2010 - Apr 2012 · 2 yrs 4 mos",
      "description": "I developed three casual games for PC. I was responsible for production, design, gameplay programming, and leading a team of graphic and sound artists.",
      "skills": ["C++", "Game Development", "Game Design"]
    }
  ],

  "skills": [
    {
      "name": "C++ programming",
      "summary": "It's my bread and butter. I've read many books and have written all kinds of software with it. I occasionally read the C++ standard to remind myself how little I know about the language. I rate myself 2 out of 10 with a plan to become 4 by the end of my career."
    },
    {
      "name": "Game development",
      "summary": "I've been building game engines professionally and as a hobby since I remember. I don't know much about rendering or physics, as I'm more interested in architecture, networking, online services, file systems, and other stuff that often goes unnoticed."
    },
    {
      "name": "JavaScript programming",
      "summary": "I'm partial to suboptimally designed languages... Nevertheless, I use JavaScript for web development, building tools, and scripting. Knowing it makes me more sympathetic of C++, and allows me to approach problems from different perspective."
    },
    {
      "name": "Web development",
      "summary": "I've been building full-stack apps for a few years now. I primarily use Node.js, React.js, and Tailwind CSS. I recently started appreciating Next.js. I'm well-versed in various concepts like server-side rendering, CSS-in-JS, bundlers, asset optimization, etc."
    }
  ],

  "projects": [
    {
      "name": "Untypical",
      "description": "The source code of my personal website.",
      "href": "https://github.com/untydev/untypical"
    },
    {
      "name": "Goodies",
      "description": "A collection of useful tools for JavaScript.",
      "href": "https://github.com/finibit/goodies"
    }
  ],

  "contact": {
    "email": "hi [at] untypical.dev",
    "phone": "DM me to get it",
    "github": "untydev",
    "linkedin": "in/dsobczyk",
    "twitter": "untydev"
  }
}
